README.org
#+TITLE: Photon Config
#+AUTHOR: Sebastian Hyland
#+PROPERTY: header-args :tangle init.el :TOC_2:
#+DATE: <2024-04-06>


* Upcoming plants
** For V1.0.0
- [X] Redefine to /Documents/EngMACS
  - [X] API from file
- [ ] Finish tutorial
- [ ] Finish keybindings setup
- [ ] Update light theme for better contrast
- [ ] Update visuals: mode line cleanup, etc.
- [ ] Write install instructions
- [ ] Create demos
- [ ] Fix links
- [ ] Redefine writing mode and light/dark mode

** For V1.1.0
- [ ] Complete GitHub
- [ ] Secure API key
- [ ] Fix LaTeX TOC

** For future
- [ ] Fix org-mode completions with spaces/allow lowercase links?
- [ ] Limit completions to org roam only?
- [ ] Investigate OCR tools, inline OCR
- [ ] Auto link nodes?
- [ ] Create config doc including:

#+BEGIN_SRC emacs-lisp
  ;; (current-time-string)
  ;; (setq doom-modeline-time-icon t)
  ;; (load "/Local/Documents/EngMACS/add-ons/EngMACS-light-theme.el")
  ;; (load "/Local/Downloads/org-starless.el")
  ;; 
  ;; 
  ;; 
  ;; (setq svg-tag-tags
  ;; '(("\\(|[A-Z]+|\\)" . ((lambda (tag)
  ;; (svg-tag-make :beg 1 :end -1))))))
  ;; (setq svg-tag-tags
  ;; '((":HELLO:" . ((lambda (tag) (svg-tag-make "HELLO"))))))
  ;; 
  ;; :WHY???:
  ;; (svg-tag-mode t)
  ;; (require 'svg-tag-mode)
  ;; 
  ;; |HELLO|
  ;; 
  ;; (load "/Local/Downloads/doom-nano-modeline-main/doom-nano-modeline-modes.el")
  ;; (nano-modeline-text-mode t)
  ;; 
  ;; 
  ;; (remove-hook 'prog-mode-hook            #'nano-modeline-prog-mode)
  ;; (remove-hook 'text-mode-hook            #'nano-modeline-text-mode)
  ;; (remove-hook 'org-mode-hook             #'nano-modeline-org-mode)
  ;; (remove-hook 'pdf-view-mode-hook        #'nano-modeline-pdf-mode)
  ;; (remove-hook 'mu4e-headers-mode-hook    #'nano-modeline-mu4e-headers-mode)
  ;; (remove-hook 'mu4e-view-mode-hook       #'nano-modeline-mu4e-message-mode)
  ;; (remove-hook 'mu4e-compose-mode-hook    #'nano-modeline-mu4e-compose-mode)
  ;; (remove-hook 'elfeed-show-mode-hook     #'nano-modeline-elfeed-entry-mode)
  ;; (remove-hook 'elfeed-search-mode-hook   #'nano-modeline-elfeed-search-mode)
  ;; (remove-hook 'elpher-mode-hook          #'nano-modeline-elpher-mode)
  ;; (remove-hook 'term-mode-hook            #'nano-modeline-term-mode)
  ;; (remove-hook 'eat-mode-hook             #'nano-modeline-eat-mode)
  ;; (remove-hook 'xwidget-webkit-mode-hook  #'nano-modeline-xwidget-mode)
  ;; (remove-hook 'messages-buffer-mode-hook #'nano-modeline-message-mode)
  ;; (remove-hook 'org-capture-mode-hook     #'nano-modeline-org-capture-mode)
  ;; (remove-hook 'org-agenda-mode-hook      #'nano-modeline-org-agenda-mode)
#+END_SRC


* Table of Contents :toc:
- [[#upcoming-plants][Upcoming plants]]
  - [[#for-v100][For V1.0.0]]
  - [[#for-v110][For V1.1.0]]
  - [[#for-future][For future]]
- [[#setup-use-package][Setup use-package]]
  - [[#garbage-collection][Garbage collection]]
  - [[#native-compilation][Native compilation]]
- [[#general-configuration][General configuration]]
- [[#functional-packages][Functional packages]]
  - [[#generalel][General.el]]
  - [[#ivy-and-ivy-rich][Ivy and Ivy-rich]]
  - [[#counsel][Counsel]]
  - [[#ripgrep][Ripgrep]]
  - [[#which-key][Which-key]]
  - [[#evil-and-evil-collection][Evil and Evil-collection]]
  - [[#hydra][Hydra]]
  - [[#helpful][Helpful]]
  - [[#projectile-and-counsel-projectile][Projectile and Counsel-projectile]]
  - [[#magit][Magit]]
  - [[#lsp-mode][LSP mode]]
  - [[#treesitter][Treesitter]]
  - [[#company-mode][Company mode]]
  - [[#auctex][AUCTeX]]
  - [[#company-auctex][Company AUCTeX]]
  - [[#lsp-latex][LSP LaTeX]]
  - [[#yasnippet][Yasnippet]]
  - [[#emacs-application-framework][Emacs Application Framework]]
  - [[#vterm][Vterm]]
  - [[#perspective][Perspective]]
  - [[#avy][Avy]]
  - [[#zoom][Zoom]]
  - [[#expand-region][Expand-region]]
  - [[#find-and-replace][Find and replace]]
- [[#visual-packages][Visual packages]]
  - [[#autothemer][Autothemer]]
  - [[#diminish][Diminish]]
  - [[#nerd-icons-and-all-the-icons][Nerd-Icons and All-The-Icons]]
  - [[#dired-and-neotree][Dired and Neotree]]
  - [[#doom-modeline-and-shrink-path][Doom Modeline and Shrink-path]]
  - [[#doom-themes][Doom Themes]]
  - [[#nano-modeline][Nano Modeline]]
  - [[#doom-dashboard][Doom Dashboard]]
  - [[#coloured-brackets][Coloured brackets]]
- [[#org-mode][Org-mode]]
  - [[#font-setup][Font setup]]
  - [[#org-initialization][Org initialization]]
  - [[#org-modern][Org-modern]]
  - [[#toc-org][TOC-org]]
  - [[#spellcheck][Spellcheck]]
  - [[#latex][LaTeX]]
  - [[#org-roam][Org Roam]]
  - [[#org-roam-ui][Org Roam UI]]
  - [[#org-transclusion][Org-transclusion]]
  - [[#company-backend-for-node-insertion][Company Backend for Node Insertion]]
  - [[#gptel][GPTel]]
- [[#language-setup][Language setup]]
  - [[#octave][Octave]]
  - [[#rust][Rust]]
- [[#custom-variables][Custom variables]]
  - [[#variables][Variables]]
  - [[#faces][Faces]]
- [[#minor-mode-and-custom-keybinds][Minor mode and custom keybinds]]
  - [[#writing-mode][Writing-mode]]
  - [[#custom-hotkeys][Custom Hotkeys]]
  - [[#reset-garbage-collection][Reset Garbage collection]]

* Setup use-package
Set up the MELPA, ELPA, and Org package archives, as well as the add-ons folder
#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents)) 
  (add-to-list 'load-path "~/.emacs.d/add-ons/")
#+end_src


Initialize use-package
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t)
  (use-package compat)
  (use-package consult)
#+end_src


** Garbage collection

Improve garbage collection performance during startup
#+BEGIN_SRC emacs-lisp
  (use-package gcmh
    :config
    (gcmh-mode 1))
  (setq gc-cons-threshold most-positive-fixnum
	gc-cons-percentage 0.6)
#+END_SRC


** Native compilation
Setup native compilation and suppress warnings
#+BEGIN_SRC emacs-lisp
  (if (boundp 'comp-deferred-compilation)
      (setq comp-deferred-compilation nil)
    (setq native-comp-deferred-compilation nil))
  (setq load-prefer-newer noninteractive)
  (setq comp-async-report-warnings-errors nil)
#+END_SRC



* General configuration

Clean up the window and set basic properties
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
  (scroll-bar-mode -1)   		        
  (tool-bar-mode -1)     		        
  (tooltip-mode -1)                            	        
  (menu-bar-mode -1)
  (auto-revert-mode 1)
  (column-number-mode t)
  (setq visible-bell t)
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (set-face-attribute 'default nil :family "Liga SFMono Nerd Font" :height 135)
  (set-face-attribute 'line-number nil :inherit 'default :foreground "#3f4040" :slant 'normal :weight 'semi-bold :family "Liga SFMono Nerd Font")
  (set-face-attribute 'line-number-current-line nil :inherit 'hl-line-default :foreground "#81a2be" :slant 'normal :weight 'extra-bold :family "Liga SFMono Nerd Font Nerd Font")
  (setq frame-title-format nil)
  (prefer-coding-system 'utf-8)
  (global-visual-line-mode 1)
  (setq default-frame-alist
	'((width . 150) (height . 45)))
  (setenv "TZ" "PST8PDT,M3.2.0,M11.1.0")
  (setq display-line-numbers-type 'relative)
  (menu-bar--display-line-numbers-mode-visual)
  (electric-pair-mode t)
  ;; Not sure about this:
  (setq global-map (make-sparse-keymap))
#+end_src

Startup code for line numbers and theme
#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook (lambda ()
				  (global-display-line-numbers-mode 1)
				  (display-line-numbers-mode -1)
				  (load-theme 'photon-dark t)
				  ))
#+end_src

Set directories
#+begin_src emacs-lisp
  (unless (file-directory-p "/Local/Documents/Photon/")
    (make-directory "/Local/Documents/Photon/")) 
  (unless (file-directory-p "/Local/Documents/Photon/auto-saves/")
    (make-directory "/Local/Documents/Photon/auto-saves/")) 
  (unless (file-directory-p "/Local/Documents/Photon/org-roam/")
    (make-directory "/Local/Documents/Photon/org-roam/")) 
  (unless (file-directory-p "/Local/Documents/Photon/snippets-custom/")
    (make-directory "/Local/Documents/Photon/snippets-custom/"))
  (unless (file-directory-p "/Local/Documents/Photon/org-agenda/")
    (make-directory "/Local/Documents/Photon/org-agenda/")) 

  (setq backup-directory-alist
	'(("." . "/Local/Documents/Photon/auto-saves/")))

  (setq auto-save-list-file-prefix '("/Local/Documents/Photon/auto-saves/")
	auto-save-file-name-transforms '((".*" "/Local/Documents/Photon/auto-saves/" t)))

  (setq org-roam-directory "/Local/Documents/Photon/org-roam")
#+end_src



* Functional packages

** General.el
Set up eng/leader-keys
#+begin_src emacs-lisp
  (global-unset-key (kbd "C-SPC"))
  ;;  (use-package general
  ;;   :config
  ;;   (general-create-definer eng/leader-keys
  ;;     :states '(normal insert visual emacs motion)
  ;;     :keymaps 'override
  ;;     :prefix "SPC"
  ;;     :global-prefix "C-a"
  ;;     :non-normal-prefix "C-a"))
#+end_src


