init.el
;; (current-time-string)
;; (setq doom-modeline-time-icon t)
;; (load "/Local/Documents/EngMACS/add-ons/EngMACS-light-theme.el")
;; (load "/Local/Downloads/org-starless.el")
;; 
;; 
;; 
;; (setq svg-tag-tags
;; '(("\\(|[A-Z]+|\\)" . ((lambda (tag)
;; (svg-tag-make :beg 1 :end -1))))))
;; (setq svg-tag-tags
;; '((":HELLO:" . ((lambda (tag) (svg-tag-make "HELLO"))))))
;; 
;; :WHY???:
;; (svg-tag-mode t)
;; (require 'svg-tag-mode)
;; 
;; |HELLO|
;; 
;; (load "/Local/Downloads/doom-nano-modeline-main/doom-nano-modeline-modes.el")
;; (nano-modeline-text-mode t)
;; 
;; 
;; (remove-hook 'prog-mode-hook            #'nano-modeline-prog-mode)
;; (remove-hook 'text-mode-hook            #'nano-modeline-text-mode)
;; (remove-hook 'org-mode-hook             #'nano-modeline-org-mode)
;; (remove-hook 'pdf-view-mode-hook        #'nano-modeline-pdf-mode)
;; (remove-hook 'mu4e-headers-mode-hook    #'nano-modeline-mu4e-headers-mode)
;; (remove-hook 'mu4e-view-mode-hook       #'nano-modeline-mu4e-message-mode)
;; (remove-hook 'mu4e-compose-mode-hook    #'nano-modeline-mu4e-compose-mode)
;; (remove-hook 'elfeed-show-mode-hook     #'nano-modeline-elfeed-entry-mode)
;; (remove-hook 'elfeed-search-mode-hook   #'nano-modeline-elfeed-search-mode)
;; (remove-hook 'elpher-mode-hook          #'nano-modeline-elpher-mode)
;; (remove-hook 'term-mode-hook            #'nano-modeline-term-mode)
;; (remove-hook 'eat-mode-hook             #'nano-modeline-eat-mode)
;; (remove-hook 'xwidget-webkit-mode-hook  #'nano-modeline-xwidget-mode)
;; (remove-hook 'messages-buffer-mode-hook #'nano-modeline-message-mode)
;; (remove-hook 'org-capture-mode-hook     #'nano-modeline-org-capture-mode)
;; (remove-hook 'org-agenda-mode-hook      #'nano-modeline-org-agenda-mode)

(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents)) 
(add-to-list 'load-path "~/.emacs.d/add-ons/")

(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
(use-package compat)
(use-package consult)

(use-package gcmh
  :config
  (gcmh-mode 1))
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)

(if (boundp 'comp-deferred-compilation)
    (setq comp-deferred-compilation nil)
  (setq native-comp-deferred-compilation nil))
(setq load-prefer-newer noninteractive)
(setq comp-async-report-warnings-errors nil)

(setq inhibit-startup-message t)
(scroll-bar-mode -1)   		        
(tool-bar-mode -1)     		        
(tooltip-mode -1)                            	        
(menu-bar-mode -1)
(auto-revert-mode 1)
(column-number-mode t)
(setq visible-bell t)
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
(set-face-attribute 'default nil :family "Liga SFMono Nerd Font" :height 135)
(set-face-attribute 'line-number nil :inherit 'default :foreground "#3f4040" :slant 'normal :weight 'semi-bold :family "Liga SFMono Nerd Font")
(set-face-attribute 'line-number-current-line nil :inherit 'hl-line-default :foreground "#81a2be" :slant 'normal :weight 'extra-bold :family "Liga SFMono Nerd Font Nerd Font")
(setq frame-title-format nil)
(prefer-coding-system 'utf-8)
(global-visual-line-mode 1)
(setq default-frame-alist
      '((width . 150) (height . 45)))
(setenv "TZ" "PST8PDT,M3.2.0,M11.1.0")
(setq display-line-numbers-type 'relative)
(menu-bar--display-line-numbers-mode-visual)
(electric-pair-mode t)
;; Not sure about this:
(setq global-map (make-sparse-keymap))

(add-hook 'emacs-startup-hook (lambda ()
				(global-display-line-numbers-mode 1)
				(display-line-numbers-mode -1)
				(load-theme 'photon-dark t)
				))

(unless (file-directory-p "/Local/Documents/Photon/")
  (make-directory "/Local/Documents/Photon/")) 
(unless (file-directory-p "/Local/Documents/Photon/auto-saves/")
  (make-directory "/Local/Documents/Photon/auto-saves/")) 
(unless (file-directory-p "/Local/Documents/Photon/org-roam/")
  (make-directory "/Local/Documents/Photon/org-roam/")) 
(unless (file-directory-p "/Local/Documents/Photon/snippets-custom/")
  (make-directory "/Local/Documents/Photon/snippets-custom/"))
(unless (file-directory-p "/Local/Documents/Photon/org-agenda/")
  (make-directory "/Local/Documents/Photon/org-agenda/")) 

(setq backup-directory-alist
      '(("." . "/Local/Documents/Photon/auto-saves/")))

(setq auto-save-list-file-prefix '("/Local/Documents/Photon/auto-saves/")
      auto-save-file-name-transforms '((".*" "/Local/Documents/Photon/auto-saves/" t)))

(setq org-roam-directory "/Local/Documents/Photon/org-roam")

(global-unset-key (kbd "C-SPC"))
;;  (use-package general
;;   :config
;;   (general-create-definer eng/leader-keys
;;     :states '(normal insert visual emacs motion)
;;     :keymaps 'override
;;     :prefix "SPC"
;;     :global-prefix "C-a"
;;     :non-normal-prefix "C-a"))

(use-package ivy
  :bind (("C-s" . swiper)
