init.el
	 :map ivy-minibuffer-map
	 ("TAB" . ivy-alt-done)	
	 ("C-l" . ivy-alt-done)
	 ("C-j" . ivy-next-line)
	 ("C-k" . ivy-previous-line)
	 :map ivy-switch-buffer-map
	 ("C-k" . ivy-previous-line)
	 ("C-l" . ivy-done)
	 ("C-d" . ivy-switch-buffer-kill)
	 :map ivy-reverse-i-search-map
	 ("C-k" . ivy-previous-line)
	 ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
(setq swiper-use-visual-line-p #'ignore)

(use-package ivy-rich
  :after (counsel)
  :diminish
  (eldoc-mode)
  :init
  (ivy-rich-mode 1))

(use-package orderless
  :after (ivy counsel ivy-rich)
  :config
  (setq ivy-re-builders-alist '((t . orderless-ivy-re-builder)))
  (add-to-list 'ivy-highlight-functions-alist '(orderless-ivy-re-builder . orderless-ivy-highlight)))

;;  (defun ivy--fussy-sort (name cands)
;;    "Sort according to closeness to string NAME the string list CANDS."
;;    (condition-case nil
;;	(let* ((bolp (= (string-to-char name) ?^))
;;	       ;; An optimized regex for fuzzy matching
;;	       ;; "abc" → "^[^a]*a[^b]*b[^c]*c"
;;	       (fuzzy-regex (concat "\\`"
;;				    (and bolp (regexp-quote (substring name 1 2)))
;;				    (mapconcat
;;				     (lambda (x)
;;				       (setq x (char-to-string x))
;;				       (concat "[^" x "]*" (regexp-quote x)))
;;				     (if bolp (substring name 2) name)
;;				     "")))
;;	       ;; Strip off the leading "^" for flx matching
;;	       (flx-name (if bolp (substring name 1) name))
;;	       cands-left
;;	       cands-to-sort)
;;
;;	  ;; Filter out non-matching candidates
;;	  (dolist (cand cands)
;;	    (when (string-match-p fuzzy-regex cand)
;;	      (push cand cands-left)))
;;
;;	  ;; pre-sort the candidates by length before partitioning
;;	  (setq cands-left (cl-sort cands-left #'< :key #'length))
;;
;;	  ;; partition the candidates into sorted and unsorted groups
;;	  (dotimes (_ (min (length cands-left) ivy-flx-limit))
;;	    (push (pop cands-left) cands-to-sort))
;;
;;	  (nconc
;;	   ;; Compute all of the flx scores in one pass and sort
;;	   (mapcar #'car
;;		   (sort (mapcar
;;			  (lambda (cand)
;;			    (cons cand
;;				  (car
;;				   (funcall
;;				    fussy-score-fn
;;				    cand flx-name
;;				    ivy--flx-cache))))
;;			  cands-to-sort)
;;			 (lambda (c1 c2)
;;			   ;; Break ties by length
;;			   (if (/= (cdr c1) (cdr c2))
;;			       (> (cdr c1)
;;				  (cdr c2))
;;			     (< (length (car c1))
;;				(length (car c2)))))))
;;	   ;; Add the unsorted candidates
;;	   cands-left))
;;      (error cands)))
;;
;;  (advice-add 'ivy--flx-sort :override 'ivy--fussy-sort)

(use-package counsel
  :diminish
  :bind (("M-x" . counsel-M-x)
	 ("C-x b" . counsel-ibuffer)
	 ("C-x C-f" . counsel-find-file))
  :config
  (setq ivy-initial-inputs-alist nil))

(use-package rg)

(use-package which-key
  :init (which-key-mode)
  :diminish
  :config
  (setq which-key-idle-delay 0.1)
  (setq which-key-popup-type 'side-window)
  (setq which-key-side-window-location 'bottom)
  (setq which-key-side-window-max-width 0.1)
  )

(use-package evil
  :diminish
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  (setq evil-respect-visual-line-mode t)
  :config
  (evil-mode t)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)
  (evil-set-undo-system 'undo-redo)
  (define-key evil-insert-state-map (kbd "C-p") (kbd "C-o P"))
  (define-key evil-insert-state-map (kbd "C-y") (kbd "C-o y"))
  (define-key evil-insert-state-map (kbd "C-x") (kbd "C-o x"))
  )

(use-package evil-collection
  :diminish evil-collection-unimpaired-mode
  :after evil
  :config
  (evil-collection-init))

;; (use-package hydra)

(use-package helpful
  :defer t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

;;   (use-package projectile
;;   :diminish
;;   :config (projectile-mode)
;;   :custom ((projectile-completion-system 'ivy))
;;   :bind-keymap
;;   ("C-c p" . projectile-command-map)
;;   ;; :init
;;   ;; NOTE: Set this to the folder where you keep your Git repos!
;;   ;; (when (file-directory-p "C:/Users/Sebastian/Documents/GitHub")
;;   ;;  (setq projectile-project-search-path '("C:/Users/Sebastian/Documents/GitHub")))
;;   ;; (setq projectile-switch-project-action #'projectile-dired)) 

;; (use-package counsel-projectile
;;   :diminish
;;   :config (counsel-projectile-mode))

(use-package magit
  :defer t
  :diminish (magit-auto-revert-mode auto-revert-mode)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(if (file-directory-p "/Local/Documents/Photon/.ssh")
    (copy-directory "/Local/Documents/Photon/.ssh" "/root/.ssh")) 
(defvar ssh-setup-buffer)
(defvar ssh-setup-status nil)
(defun ssh-setup ()
  (interactive)
  (if (equal ssh-setup-status nil)
      (setq ssh-setup-buffer (current-buffer))
    (shell)
    (process-send-string "*shell*" "chmod 600 /root/.ssh/id_ed25519 && ssh-agent > /dev/null 2>&1 && eval $(ssh-agent) > /dev/null 2>&1 && ssh-add ~/.ssh/id_ed25519 \n")
    (switch-to-buffer ssh-setup-buffer)
    (setq ssh-setup-status t)))
(add-hook 'magit-mode-hook #'ssh-setup)

;;  (defun lsp-mode-setup ()
;;    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
;;    (lsp-headerline-breadcrumb-mode))

;; (use-package lsp-mode
;;   :commands (lsp lsp-deferred)
;;   ;; :hook (lsp-mode . lsp-mode-setup)
;;   :init
;;   (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
;;   :config
;;   (lsp-enable-which-key-integration t))

;; (use-package lsp-ui
;;   :hook (lsp-mode . lsp-ui-mode)
;;   :custom
;;   (lsp-ui-doc-position 'bottom))

;; (setq tsc-dyn-get-from '(:compilation))
;; (setq tsc-dyn-dir '"/root/.emacs.d/add-ons/elisp-tree-sitter")
(use-package tree-sitter)
(use-package tree-sitter-langs)
;; (require 'tree-sitter-hl)
;; (require 'tree-sitter-debug)
;; (require 'tree-sitter-query)
(add-hook 'prog-mode-hook #'tree-sitter-hl-mode)

(use-package company
  :defer t
  :hook
  (lsp-mode . company-mode)
  (org-mode . company-mode)
  :bind (:map company-active-map
	      ("<tab>" . company-complete-selection)
	      ("<return>" . nil))
  :init
  (company-mode 1)
  (company-mode -1)
  (setq company-minimum-prefix-length 2)
  (setq company-idle-delay 0.0))

(use-package company-box
  :defer t
  :diminish
  :hook (company-mode . company-box-mode))
