init.el

(use-package auctex
  :defer t
  :ensure t)
;; (add-hook 'org-mode-hook (lambda () (require 'org-auctex)))
;; (add-hook 'org-mode-hook (lambda () (org-auctex-mode 1)))
(setq preview-auto-cache-preamble t)

;; (use-package company-auctex
;;   :diminish
;;   :config
;;   (company-auctex-init))

;; (use-package consult
;;   :init)
;; (require 'lsp-latex)
;; (setq lsp-latex-texlab-executable "~/.emacs.d/add-ons/texlab/texlab.exe")

(use-package yasnippet
  :config
  (setq yas-snippet-dirs '("/Local/Documents/Photon/snippets-custom"))
  (setq yas-snippet-dirs (append yas-snippet-dirs '("/root/.emacs.d/snippets-core/")))
  (yas-global-mode 1))

;; (add-to-list 'load-path "~/.emacs.d/add-ons/EAF")
;; (add-to-list 'load-path "~/.emacs.d/add-ons/EAF/app/browser")
;; (add-to-list 'load-path "~/.emacs.d/add-ons/EAF/app/pdf-viewer")
;; (require 'eaf)
;; (require 'eaf-browser)
;; (require 'eaf-pdf-viewer)
;; (use-package epc :defer t :ensure t)
;; (use-package ctable :defer t :ensure t)
;; (use-package deferred :defer t :ensure t)
;; (use-package s :defer t :ensure t)

(use-package vterm
  :load-path "~/.emacs.d/vterm")
(use-package vterm-toggle
  :config
  (setq vterm-toggle-fullscreen-p nil)
  (setq vterm-shell "fish")
  (add-to-list 'display-buffer-alist
	       '((lambda (buffer-or-name _)
		   (let ((buffer (get-buffer buffer-or-name)))
		     (with-current-buffer buffer
		       (or (equal major-mode 'vterm-mode)
			   (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
		 (display-buffer-reuse-window display-buffer-at-bottom)
		 (reusable-frames . visible)
		 (window-height . 0.35))))

(use-package perspective
  :init
  (setq persp-suppress-no-prefix-key-warning t)
  :config
  (persp-mode t))

;;    (eng/leader-keys
;;      "b" '(persp-counsel-switch-buffer :which-keys "Switch buffer...")
;;      "p" '(persp-switch :which-keys "Switch perspective..."))

(use-package avy)

(use-package zoom
  :init
  (zoom-mode t)
  )

(use-package expand-region)

(use-package visual-regexp-steroids)

(use-package autothemer
  :ensure t)
(add-to-list 'custom-theme-load-path "~/.emacs.d/add-ons")

;; (use-package diminish)
;; (diminish 'visual-line-mode)

(use-package nerd-icons
  :custom
  (nerd-icons-color-icons t)
  (nerd-icons-scale-factor 1)
  )

(use-package all-the-icons
  :custom
  (all-the-icons-scale-factor 1)
  (all-the-icons-install-fonts)
  )

(eval-after-load 'dired '(progn (require 'joseph-single-dired)))
(add-hook 'dired-mode-hook #'dired-hide-details-mode)

(use-package neotree
  :config
  (setq neo-theme 'icons))

(use-package nerd-icons-dired
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package nerd-icons-ivy-rich
  :init
  (nerd-icons-ivy-rich-mode 1))

;;  (eng/leader-keys
;;    "d e" '(wdired-change-to-wdired-mode :which-key "Enter Wdired mode")
;;    "<return>" (kbd "C-c C-c")
;;    )
;;    "SPC n" "Org Roam Commands"
;;    "SPC p" "LaTeX Preview Commands"
;;    "SPC v" "Transclusion Commands"
;;
;;  (which-key-add-key-based-replacements
;;    "SPC <return>" "Complete/Execute"
;;    )

(use-package shrink-path
  :ensure t
  :demand t
  :diminish)

;; (require 'doom-modeline)
;; (require 'doom-modeline-autoloads)
;; (require 'doom-modeline-core)
;; (require 'doom-modeline-env)
;; ;; (require 'doom-modeline-pkg)
;; (require 'doom-modeline-segments)
;; 
;; (add-hook 'emacs-startup-hook (lambda () (doom-modeline-mode 1)))
;; 
;; (custom-set-variables
;; '(doom-modeline-major-mode-icon t)
;; '(doom-modeline-major-mode-color-icon t)
;; '(doom-modeline-buffer-state-icon t)
;; '(doom-modeline-buffer-modification-icon nil)
;; '(doom-modeline-buffer-encoding nil)
;; '(doom-modeline-icon t)
;; '(doom-modeline-time-icon nil)
;; '(doom-modeline-time-live-icon nil)
;; '(doom-modeline-time-clock-size 0.3)
;; '(doom-modeline-buffer-name t)
;; '(doom-modeline-height 40)
;; '(doom-modeline-support-imenu t)
;; '(doom-modeline-bar-width 6)
;; '(doom-modeline-position-column-line-format '("%l:%c"))
;; '(doom-modeline-minor-modes t)
;; '(doom-modeline-enable-word-count t)
;; '(doom-modeline-unicode-fallback t))
;; 
;; (custom-set-faces
;; '(doom-modeline ((t (:family "SF Mono"))))
;; '(doom-modeline-bar ((t (:background "#9099AB" :family "SF Mono"))))
;; '(doom-modeline-icon ((t (:family "Symbols Nerd Font Mono" :height 100))))
;; '(doom-modeline-icon-inactive ((t (:family "Symbols Nerd Font Mono" :height 100))))
;; '(mode-line ((t (:family "SF Mono"))))
;; '(mode-line-active ((t (:family "SF Mono"))))
;; '(mode-line-inactive ((t (:family "SF Mono")))))

(use-package doom-themes)
;; :defer t
;; :ensure t
;; :config
;; (setq doom-themes-enable-bold t 
;; doom-themes-enable-italic t)
;; (doom-themes-visual-bell-config))
