init.el

;; (require 'doom-nano-modeline)
;; (require 'doom-nano-modeline-core)
;; (require 'doom-nano-modeline-misc)
;; (require 'doom-nano-modeline-modes)
;; (doom-nano-modeline-mode 1)


;; (defun get-current-perspective ()
;; "Return the current perspective name, if any."
;; (let ((perspective (persp-curr)))
;; (if perspective
;; `((,(perspective-name perspective) . font-lock-comment-face)
;; (" " . nil))
;; nil)))
;; 
;; (setq doom-nano-modeline-append-information #'get-current-perspective)

(require 'doom-nano-modeline)
(require 'doom-nano-modeline-core)
(require 'doom-nano-modeline-misc)
(require 'doom-nano-modeline-modes)
(doom-nano-modeline-mode t)

;; (use-package nano-modeline
;; :config
;; (nano-modeline-text-mode t)
;; :hook
;; (prog-mode-hook            . nano-modeline-prog-mode)
;; (text-mode-hook            . nano-modeline-text-mode)
;; (org-mode-hook             . nano-modeline-org-mode)
;; (pdf-view-mode-hook        . nano-modeline-pdf-mode)
;; (mu4e-headers-mode-hook    . nano-modeline-mu4e-headers-mode)
;; (mu4e-view-mode-hook       . nano-modeline-mu4e-message-mode)
;; (mu4e-compose-mode-hook    . nano-modeline-mu4e-compose-mode)
;; (elfeed-show-mode-hook     . nano-modeline-elfeed-entry-mode)
;; (elfeed-search-mode-hook   . nano-modeline-elfeed-search-mode)
;; (elpher-mode-hook          . nano-modeline-elpher-mode)
;; (term-mode-hook            . nano-modeline-term-mode)
;; (vterm-mode-hook           . nano-modeline-term-mode)
;; (eshell-mode-hook          . nano-modeline-term-mode)
;; (eat-mode-hook             . nano-modeline-eat-mode)
;; (xwidget-webkit-mode-hook  . nano-modeline-xwidget-mode)
;; (messages-buffer-mode-hook . nano-modeline-message-mode)
;; (org-capture-mode-hook     . nano-modeline-org-capture-mode)
;; (org-agenda-mode-hook      . nano-modeline-org-agenda-mode)
;; )

(use-package hide-mode-line
  :init
  (global-hide-mode-line-mode t))

(use-package spacious-padding
  :init
  (spacious-padding-mode))

;; (set-face-attribute 'nano-modeline-status nil :foreground "black" :weight 'bold)

;; (defun nano-modeline-set-evil-color ()
;; (cond
;; ((eq evil-state 'normal)
;; (set-face-attribute 'nano-modeline-status nil
;; :background "#7FB4CA"))
;; ((eq evil-state 'insert)
;; (set-face-attribute 'nano-modeline-status nil
;; :background "#98BB6C"))
;; ((eq evil-state 'visual)
;; (set-face-attribute 'nano-modeline-status nil
;; :background "#FF5D62"))
;; ((eq evil-state 'emacs)
;; (set-face-attribute 'nano-modeline-status nil
;; :background "#957FB8"))))
;; 
;; (add-hook 'evil-normal-state-entry-hook #'nano-modeline-set-evil-color)
;; (add-hook 'evil-insert-state-entry-hook #'nano-modeline-set-evil-color)
;; (add-hook 'evil-visual-state-entry-hook #'nano-modeline-set-evil-color)
;; (add-hook 'evil-emacs-state-entry-hook #'nano-modeline-set-evil-color)

;; (defun nano-modeline-save-indicator ()
;; (if (buffer-modified-p)
;; (set-face-attribute 'nano-modeline--empty-face nil
;; :foreground "#FF5D62"
;; :background "#2A2A37")
;; (set-face-attribute 'nano-modeline--empty-face nil
;; :foreground "#E6E3D3")))
;; 
;; (add-hook 'post-command-hook #'nano-modeline-save-indicator)
;; (add-hook 'after-save-hook #'nano-modeline-save-indicator)

(use-package dashboard
  :ensure t
  :init
  :config
  (dashboard-setup-startup-hook)
  )
(load-file "~/.emacs.d/add-ons/photon-dashboard.el")
(add-hook 'window-setup-hook (lambda () (dashboard-open)))
(add-hook 'window-setup-hook (lambda() (set-face-attribute 'dashboard-heading nil
							   :family "Liga SFMono Nerd Font")))
(setq nerd-icons-font-family "Symbols Nerd Font Mono")

(use-package rainbow-delimiters
  :defer t
  :diminish
  :hook (prog-mode . rainbow-delimiters-mode))

(defun org-font-setup ()
  (interactive)
  "Customizes Org mode fonts for headings and list hyphens."
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
			  '(("^ *\\([-]\\) "
			     (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  (dolist (face '((org-level-1 . 1.9)
		  (org-level-2 . 1.6)
		  (org-level-3 . 1.35)
		  (org-level-4 . 1.15)
		  (org-level-5 . 1.1)
		  (org-level-6 . 1.1)
		  (org-level-7 . 1.1)
		  (org-level-8 . 1.1)
		  (org-document-title . 2.3)
		  (org-document-info . 1.5)
		  (org-meta-line . 1.15)))
    (set-face-attribute (car face) nil :height (cdr face)))

  (dolist (face '((org-level-1)
		  (org-level-2)
		  (org-document-title)
		  ))
    (set-face-attribute (car face) nil :weight 'extrabold))

  (dolist (face '((org-level-3)
		  (org-level-4)
		  (org-document-info)
		  ))
    (set-face-attribute (car face) nil :weight 'bold))

  (dolist (face '((org-level-5)
		  (org-level-6)
		  (org-level-7)
		  (org-level-8)
		  (org-meta-line)
		  ))
    (set-face-attribute (car face) nil :weight 'medium))

  (set-face-attribute 'org-block nil :family "Liga SFMono Nerd Font")
  (set-face-attribute 'org-table nil :family "Liga SFMono Nerd Font"))

(add-hook 'org-mode-hook
	  (lambda ()
	    (variable-pitch-mode t)))
(add-hook 'org-mode-hook 'org-font-setup)
(set-face-attribute 'variable-pitch nil :family "SF Pro Text")

(use-package org
  :config
  (setq org-ellipsis " ▾")
  (delete-selection-mode t)
  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (octave . t)
       (latex . t)
       (python .t)))
    ))

;; (use-package modus-themes)
;; (use-package org-modern
;; :diminish
;; :custom
;; ;; Edit settings
;; (org-auto-align-tags nil)
;; (org-tags-column 0)
;; (org-catch-invisible-edits 'show-and-error)
;; (org-special-ctrl-a/e t)
;; (org-insert-heading-respect-content t)
;; ;; Org styling, hide markup etc.
;; (org-hide-emphasis-markers t)
;; (org-ellipsis "…"))

(use-package toc-org
  :ensure t
  :config
  (add-hook 'org-mode-hook 'toc-org-mode)
  (add-hook 'markdown-mode-hook 'toc-org-mode)
  )

(use-package flyspell-correct-ivy
  :bind ("C-M-;" . flyspell-correct-wrapper)
  :init
  (setq flyspell-correct-interface #'flyspell-correct-ivy)
  (evil-define-key 'normal flyspell-mode-map (kbd "<return>") #'flyspell-correct-wrapper)
  (evil-define-key 'visual flyspell-mode-map (kbd "<return>") #'flyspell-correct-wrapper))

(unless (file-directory-p "~/.emacs.d/previewcache")
  (make-directory "~/.emacs.d/previewcache")) 
(setq temporary-file-directory "~/.emacs.d/previewcache")
(setq org-latex-pdf-process '("latex -shell-escape -interaction nonstopmode %f"))
(setq org-latex-create-formula-image-program 'dvipng)
(setq org-preview-latex-default-process 'dvipng)
(setq org-latex-pdf-process '("pdflatex -interaction nonstopmode -output-directory %o %f"))
(use-package math-preview
  :config (math-preview-start-process))

(use-package org-roam
  :ensure t
  :bind (("C-c n l" . org-roam-buffer-toggle)
	 ("C-c n f" . org-roam-node-find)
	 ("C-c n i" . org-roam-node-insert))
  :config
  (org-roam-setup))

(use-package org-roam-ui
  :ensure t
  :diminish
  :config
  (setq org-roam-ui-sync-theme t
	org-roam-ui-follow t
	org-roam-ui-update-on-save t
	org-roam-ui-open-on-start t))

(use-package org-transclusion
  :ensure t
  :diminish
  )
