init.el

(defun org-roam-node-candidates ()
  ;; (org-roam-db-sync) ; Synchronize the Org-roam database to ensure it's up-to-date
  (mapcar (lambda (node)
	    (cons (org-roam-node-title node)
		  (format "[[id:%s][%s]]" (org-roam-node-id node) (org-roam-node-title node))))
	  (org-roam-node-list)))

(defvar company-node-candidates (org-roam-node-candidates))

(defun company-node-backend (command &optional arg &rest ignored)
  (interactive (list 'interactive))
  (cl-case command
    (interactive (company-begin-backend 'company-node-backend))
    (prefix (and (eq major-mode 'org-mode) (company-grab-symbol)))
    (candidates
     (let ((prefix (downcase arg)))
       (seq-filter
	(lambda (candidate)
	  (string-prefix-p prefix (downcase candidate)))
	(mapcar #'car company-node-candidates))))
    (annotation
     "[Node]")
    (ignore-case t)
    (post-completion
     (let ((selected-candidate (assoc arg company-node-candidates)))
       (when selected-candidate
	 (delete-region (- (point) (length arg)) (point))
	 (insert (cdr selected-candidate)))))))

;; Add the backend to the list of backends
(add-to-list 'company-backends 'company-node-backend)
(add-hook 'org-mode-hook (lambda () (setq-local company-backends '(company-node-backend))))

(defun org-roam-node-update ()
  (let ((candidates (org-roam-node-candidates)))
    (setq company-node-candidates candidates)
    (add-to-list 'company-backends 'company-node-backend)))

(org-roam-node-update) ; Call it once to set up initially

(run-with-timer 0 5 #'org-roam-node-update)

(unless (file-directory-p "/Local/Documents/Photon/keychain/")
  (make-directory "/Local/Documents/Photon/keychain/"))
(unless (file-exists-p "/Local/Documents/Photon/keychain/gemini")
  (write-region "" nil "/Local/Documents/Photon/keychain/gemini"))

(defun get-gemini-key ()
  (with-temp-buffer
    (insert-file-contents "/Local/Documents/Photon/keychain/gemini")
    (string-trim (buffer-string))))

(use-package gptel)
(unless (string-empty-p (get-gemini-key))
  (setq
   gptel-model "gemini-1.5-pro-latest"
   gptel-default-mode 'org-mode
   gptel--system-message ""
   gptel-backend (gptel-make-gemini "Gemini"
		   :key (get-gemini-key)
		   :stream t)))
;; (require 'gptel-extensions)

(add-to-list 'auto-mode-alist '("\\.m$" . octave-mode))
(setq org-confirm-babel-evaluate nil)

(use-package rustic)

;; (custom-set-variables
;; '(custom-safe-themes '("796c44be3d1352f823614b1c75023018053fcdc56d88801874d6c939354f7d99" "a9eeab09d61fef94084a95f82557e147d9630fbbb82a837f971f83e66e21e5ad" "b29ba9bfdb34d71ecf3322951425a73d825fb2c002434282d2e0e8c44fce8185" "9f297216c88ca3f47e5f10f8bd884ab24ac5bc9d884f0f23589b0a46a608fe14" "6a5584ee8de384f2d8b1a1c30ed5b8af1d00adcbdcd70ba1967898c265878acf" "9013233028d9798f901e5e8efb31841c24c12444d3b6e92580080505d56fd392" "a9abd706a4183711ffcca0d6da3808ec0f59be0e8336868669dc3b10381afb6f" "8d8207a39e18e2cc95ebddf62f841442d36fcba01a2a9451773d4ed30b632443" "f5f80dd6588e59cfc3ce2f11568ff8296717a938edd448a947f9823a4e282b66" "4990532659bb6a285fee01ede3dfa1b1bdf302c5c3c8de9fad9b6bc63a9252f7" "8c7e832be864674c220f9a9361c851917a93f921fedb7717b1b5ece47690c098" "e70e87ad139f94d3ec5fdf782c978450fc2cb714d696e520b176ff797b97b8d2" "77fff78cc13a2ff41ad0a8ba2f09e8efd3c7e16be20725606c095f9a19c24d3d" "34cf3305b35e3a8132a0b1bdf2c67623bc2cb05b125f8d7d26bd51fd16d547ec" "571661a9d205cb32dfed5566019ad54f5bb3415d2d88f7ea1d00c7c794e70a36" "e1f4f0158cd5a01a9d96f1f7cdcca8d6724d7d33267623cc433fe1c196848554" "7e377879cbd60c66b88e51fad480b3ab18d60847f31c435f15f5df18bdb18184" "1f292969fc19ba45fbc6542ed54e58ab5ad3dbe41b70d8cb2d1f85c22d07e518" "88f7ee5594021c60a4a6a1c275614103de8c1435d6d08cc58882f920e0cec65e" default))
;; '(package-selected-packages
;; '(org-modern modus-themes diminish evil-collection evil magit general helpful rainbow-delimiters which-key counsel-projectile projectile company-auctex company auctex org-bullets ivy-rich dashboard vterm kanagawa-theme flycheck cargo rust-mode zuul treemacs-nerd-icons nerdtab mood-line doom-themes doom-modeline-now-playing counsel)))

;; (set-face-attribute 'line-number nil :inherit 'default :foreground "#3f4040" :slant normal :weight semi-bold :family "JetBrainsMono Nerd Font")
;; (set-face-attribute 'line-number-current-line nil :inherit (hl-line default) :foreground "#81a2be" :slant normal :weight extra-bold :family "JetBrainsMono Nerd Font")
