README.org
** Writing-mode

Use a dark theme with JetBrainsMono for programming, a light theme with Iosevka for text editing
#+begin_src emacs-lisp
  ;; (define-minor-mode writing-mode
  ;; "Toggle between a writing and programming environment."
  ;; :global t
  ;; :init-value nil
  ;; (if writing-mode
  ;; (progn
  ;; ;; Set fonts and themes  [TODO: FIX TABLES]
  ;; (set-face-attribute 'default nil :family "Iosevka")
  ;; (set-face-attribute 'variable-pitch nil :family "Iosevka Aile")
  ;; (set-face-attribute 'org-modern-symbol nil :family "Iosevka")
  ;; (global-display-line-numbers-mode -1)
  ;; (display-line-numbers-mode -1)
  ;; ;; (modus-themes-with-colors
  ;; ;;   (set-face-attribute 'mode-line nil
  ;; ;; 		      :background "white smoke"
  ;; ;; 		      :foreground "black"
  ;; ;; 		      :box nil)
  ;; ;;   (set-face-attribute 'mode-line-inactive nil
  ;; ;; 		      :background bg-dim
  ;; ;; 		      :foreground fg-dim))
  ;; (set-face-background 'org-block-begin-line "ffffff")
  ;; (set-face-background 'org-block "dbe4f1")
  ;; (global-org-modern-mode 1)
  ;; (setq global-hl-line-mode nil)
  ;; 
  ;; ;; Change modeline
  ;; (setq header-line-format mode-line-format)
  ;; (setq-default header-line-format mode-line-format)
  ;; (setq mode-line-format nil)
  ;; (setq-default mode-line-format nil)
  ;; ;; (add-hook 'after-change-major-mode-hook (lambda () (setq mode-line-format nil)))
  ;; ;; (add-hook 'after-change-major-mode-hook (lambda () (setq header-line-format mode-line-format)))
  ;; ;; (add-hook 'after-change-major-mode-hook (lambda () (setq-default header-line-format mode-line-format))
  ;; 
  ;; ;; Modify frame
  ;; (with-selected-frame (selected-frame)
  ;; (modify-frame-parameters
  ;; nil
  ;; '((right-divider-width . 25)
  ;; (internal-border-width . 25))))
  ;; (dolist (face '(window-divider
  ;; window-divider-first-pixel
  ;; window-divider-last-pixel))
  ;; (face-spec-reset-face face)
  ;; (set-face-foreground face (face-attribute 'default :background)))
  ;; (set-face-background 'fringe (face-attribute 'default :background))
  ;; (fringe-mode 10)
  ;; 
  ;; ;; Set writing mode flag
  ;; (setq writing-mode-active t)
  ;; (message "Writing mode active"))
  ;; 
  ;; (progn
  ;; ;; Set fonts and themes
  ;; (set-face-attribute 'default nil :family "JetBrainsMonoNL NF" :height 110)
  ;; (global-display-line-numbers-mode 1)
  ;; (display-line-numbers-mode 1)
  ;; (global-org-modern-mode -1)
  ;; (setq global-hl-line-mode t)
  ;; (set-face-background 'org-block-begin-line "1a1c23")
  ;; (set-face-background 'org-block "1a1c23")
  ;; 
  ;; ;; Change modeline
  ;; (setq header-line-format nil)
  ;; (setq-default header-line-format nil)
  ;; ;; (remove-hook 'after-change-major-mode-hook (lambda () (setq mode-line-format nil)))
  ;; ;; (remove-hook 'after-change-major-mode-hook (lambda () (setq header-line-format mode-line-format)))
  ;; ;; (remove-hook 'after-change-major-mode-hook (lambda () (setq-default header-line-format mode-line-format)))
  ;; ;; (add-hook 'after-change-major-mode-hook (lambda () (setq header-line-format nil)))
  ;; ;; (remove-hook 'after-change-major-mode-hook (lambda () (setq-default header-line-format nil)))
  ;; (doom-modeline-mode)
  ;; ;; (add-hook 'after-change-major-mode-hook (lambda () (doom-modeline-mode)))
  ;; 
  ;; ;; Modify frame
  ;; (with-selected-frame (selected-frame)
  ;; (modify-frame-parameters
  ;; nil
  ;; '((right-divider-width . 0)
  ;; (internal-border-width . 0))))
  ;; (face-spec-reset-face 'fringe)
  ;; (fringe-mode 20)
  ;; 
  ;; ;; Set programming mode flag
  ;; (setq writing-mode-active nil)
  ;; (message "Programming mode active")))
  ;; ))
#+end_src


Trigger theme-swaping non-recursively with a custom function
#+begin_src emacs-lisp
  ;; (defvar my-light-theme 'modus-operandi)
  ;; (defvar my-dark-theme 'EngMACS-dark)
  ;; (defvar my-current-theme my-dark-theme)
  ;; 
  ;; (defun toggle-writing-mode ()
  ;; "Toggle between light and dark themes."
  ;; (interactive)
  ;; (if (eq my-current-theme my-light-theme)
  ;; (progn
  ;; (disable-theme my-light-theme)
  ;; (load-theme my-dark-theme t)
  ;; (setq my-current-theme my-dark-theme)
  ;; (writing-mode -1))
  ;; (progn
  ;; (disable-theme my-dark-theme)
  ;; (load-theme my-light-theme t)
  ;; (setq my-current-theme my-light-theme)
  ;; (writing-mode 1))))
#+end_src



