README.org
** Custom Hotkeys

Custom functions
#+BEGIN_SRC emacs-lisp
      (defface photon-transient-dynamic-face
	'((t (:foreground "#7FB4CA" :weight bold)))
	"Face for dynamic transients")

      (defun photon-find-file ()
	(interactive)
	(if (stringp buffer-file-name)
	    (cond
	     ((eq major-mode 'dired-mode)
	      (counsel-find-file))
	     ((string-match "/Local/" (buffer-file-name))
	      (counsel-find-file))
	     (t
	      (counsel-find-file nil "/Local/")))
	  (counsel-find-file nil "/Local/")))

      (defun photon-C-j ()
	(interactive)
	(if (minibuffer-window-active-p (selected-window))
	    (ivy-next-line)
	  (execute-kbd-macro (kbd "G")))) 

      (defun photon-C-k ()
	(interactive)
	(if (minibuffer-window-active-p (selected-window))
	    (ivy-previous-line)
	  (execute-kbd-macro (kbd "gg"))))

      (transient-define-suffix global-scale-inc ()
	:transient t
	:key "]"
	:description "Increase globally"
	(interactive)
	(global-text-scale-adjust 2) (kbd "<escape>"))

      (transient-define-suffix global-scale-dec ()
	:transient t
	:key "["
	:description "Decrease globally"
	(interactive)
	(global-text-scale-adjust -2) (kbd "<escape>"))

      (transient-define-suffix toggle-theme ()
	:transient nil
	:key "<return>"
	:description "Toggle light/dark theme"
	(interactive)
	(if (eq 'EngMACS-dark (car custom-enabled-themes))
	    (load-theme 'EngMACS-light t)
	  (load-theme 'EngMACS-dark t)))

      (use-package org-modern
	:init
	(setq org-modern-hide-stars 't)
	(setq org-modern-block-fringe 6))

      (defun org-entities-show ()
	(interactive)
	(setq org-hide-emphasis-markers nil)
	(global-org-modern-mode -1)
	(dolist (buf (match-buffers '(major-mode . org-mode)))
	  (with-current-buffer buf
	    (display-line-numbers-mode t)))
	(remove-hook 'org-mode-hook (lambda () (display-line-numbers-mode -1))))

      (defun org-entities-hide ()
	(interactive)
	(setq org-hide-emphasis-markers t)
	(global-org-modern-mode t)
	(dolist (buf (match-buffers '(major-mode . org-mode)))
	  (with-current-buffer buf
	    (display-line-numbers-mode -1)))
	(add-hook 'org-mode-hook (lambda () (display-line-numbers-mode -1))))

      (defvar org-entities-state "HIDDEN")

      (defun org-entities-toggle ()
	(interactive)
	(if (equal org-entities-state "HIDDEN")
	    (progn
	      (org-entities-show)
	      (setq org-entities-state "VISIBLE"))
	  (progn
	    (org-entities-hide)
	    (setq org-entities-state "HIDDEN"))))

      (org-entities-hide)


      (defun photon-face-selection ()
	"Presents the user with options to set the variable-pitch font face."
	(interactive)
	(let* ((font-choices '("Sans-serif" "Serif" "Monospace"))
	       (choice (completing-read "Choose typeface class: " font-choices nil t))
	       (font-mapping '(("Sans-serif" . "SF Pro Text")
			       ("Serif" . "Lora")
			       ("Monospace" . "Liga SFMono Nerd Font")))
	       (selected-font (cdr (assoc choice font-mapping))))
	  (set-face-attribute 'variable-pitch nil :family selected-font)))

  (defvar photon-opp-theme "light")

  (defun photon-theme-toggle ()
    (interactive)
    (if (equal (car custom-enabled-themes) 'photon-dark)
	(progn (load-theme 'photon-light t) (setq photon-opp-theme "dark"))
      (progn (load-theme 'photon-dark t) (setq photon-opp-theme "light")))
	  (org-font-setup))

      (use-package org-fragtog
	:load-path "~/.emacs.d/add-ons"
	:hook (org-mode . org-fragtog-mode))

#+END_SRC

#+BEGIN_SRC emacs-lisp
		(transient-define-prefix photon/main ()
		  [:description
		   " "
		   ["  Open and save files"
		    :pad-keys nil
		    ("s" "Save current buffer" save-buffer)
		    ("S" "󰁣 Save as..." write-file)
		    ("o" "Open file..." photon-find-file)
		    ("r" "Open recent..." recentf-open)
		    ""
		    ""
		    "  Quick commands"
		    ("f" "Search in buffer..." swiper)
		    ("F" "󰁣 Search in directory..." counsel-rg)
		    ("x" "Execute command..." counsel-M-x)
		    ("p" "Switch perspective..." persp-switch)
		    ]
		   ["  Buffer actions"
		    ("b" "Switch buffer...     " persp-counsel-switch-buffer)
		    ("l" "Next buffer" next-buffer :transient t)
		    ("h" "Previous buffer" previous-buffer :transient t)
		    ("k" "Kill current buffer" kill-current-buffer)
		    ("K" "󰁣 Kill buffer..." persp-kill-buffer*)
		    ""
		    "  Text scaling"
		    ("=" "Increase in current buffer" text-scale-increase :transient t)
		    ("-" "Decrease in current buffer" text-scale-decrease :transient t)
		    (global-scale-inc)
		    (global-scale-dec)
		    ]
		   ["  Keybind sets"
		    ("w" "   Window settings..." photon/window)
		    ("m" "   Math preview..." counsel-M-x)
		    ("e" "   Editing tools..." photon/editing)
		    ("d" " 󰈙  Org document tools..." photon/org)
		    ("c" "   Coding tools..." photon/coding)
		    ]]
		  )

		(transient-define-prefix photon/editing ()
		  [" "
		   ["  Spellcheck"
		    ("c" "Correct word at cursor..." flyspell-correct-wrapper)
		    ]])

		(transient-define-prefix photon/coding ()
		  [" "
		   ["  Terminal tools"
		    ("<return>" "Toggle popup terminal" vterm-toggle)
		    ]])

		(transient-define-prefix photon/window ()
		  [" "
		   ["󱂬  Manage windows"
		    ("r" "Create on right" split-window-right)
		    ("b" "Create below" split-window-below)
		    ("q" "Close current window" delete-window)
		    ]
		   ["󰆾  Move between windows"
		    ("h" "Move left" windmove-left)
		    ("j" "Move down" windmove-down)
		    ("k" "Move up" windmove-up)
		    ("l" "Move right" windmove-right)
		    ]
	      [
	  "󰏘 Visual settings"
	  ("t" photon-theme-toggle
    :description
    (lambda ()
  (format "Activate %s theme" photon-opp-theme)))
	    ]])

		(transient-define-prefix photon/org ()
		  [" "
		   ["󱓦 Editing commands"
		    ("e" "Expand selection" er/expand-region)
		    ("c" "Contract selection" er/contract-region)
		    ("t" "Tangle code blocks" org-babel-tangle)
		    ]
		   [" Visual commands"
		    ("v" org-entities-toggle
		     :description
		     (lambda ()
		       (format "Toggle entities [%s]" (propertize org-entities-state 'face 'photon-transient-dynamic-face))))
		    ("f" "Change document font..." photon-face-selection)
		    ]
		   ["󱃖 LaTeX commands"
		    ("p" org-fragtog-mode
		     :description
		     (lambda ()
		       (format "Toggle LaTeX auto-preview [%s]" (if org-fragtog-mode
								    (propertize "ACTIVE" 'face 'photon-transient-dynamic-face)
								  (propertize "INACTIVE" 'face 'photon-transient-dynamic-face))))
		     )
		    ("a" "Preview all LaTeX fragments" math-preview-all)
		    ("d" "Clear all LaTeX fragments" math-preview-clear-all)
		    ]
		   ])

#+END_SRC


Photon Keybinds
#+BEGIN_SRC emacs-lisp

    (defvar photon-keymap (make-keymap)
      "Keymap for Photon general bindings")

    (define-minor-mode photon-mode
      "Minor mode for my personal keybindings."
      :init-value t
      :global t
      :keymap photon-keymap)

    (add-to-list 'emulation-mode-map-alists
		 `((photon-mode . ,photon-keymap)))

    (photon-mode t)
    (dolist (binding '(("C-SPC" . photon/main)
		       ("<normal-state> SPC" . photon/main)
		       ("<visual-state> SPC" . photon/main)
		       ("M-h" . windmove-left)
		       ("M-j" . windmove-down)
		       ("M-k" . windmove-up)
		       ("M-l" . windmove-right)
		       ("C-j" . photon-C-j)
		       ("C-k" . photon-C-k)
		       ("C-? k" . describe-key)
		       ("C-? f" . counsel-describe-function)
		       ("C-? v" . counsel-describe-variable)
		       ))
      (define-key photon-keymap (kbd (car binding)) (cdr binding)))

    (dolist (state '("normal" "visual"))
      (let ((map (symbol-value (intern (concat "evil-" state "-state-map")))))
	(define-key map (kbd "SPC") 'photon/main)
        (define-key map (kbd "<backspace>") "\"_x")
        (define-key map (kbd "H") 'evil-backward-word-begin)
	(define-key map (kbd "J") 'evil-forward-paragraph)
	(define-key map (kbd "K") 'evil-backward-paragraph)
	(define-key map (kbd "L") 'evil-forward-word-end)
	(define-key map (kbd "C-h") 'evil-beginning-of-visual-line)      
	(define-key map (kbd "C-j") 'evil-goto-line)      
	(define-key map (kbd "C-k") 'evil-goto-first-line)      
	(define-key map (kbd "C-l") 'evil-end-of-visual-line)
	(define-key map (kbd "f") 'evil-avy-goto-char-2)
	(define-key map (kbd "F") 'evil-avy-goto-word-1)
	))

     (define-key dired-mode-map (kbd "<normal-state> SPC") 'photon/main)
     (define-key dired-mode-map (kbd "<visual-state> SPC") 'photon/window)
    ;; (define-key org-mode-map (kbd "<normal-state> C-k") 'evil-goto-first-line)
    ;; (define-key org-mode-map (kbd "<normal-state> C-j") 'evil-goto-line)
    ;; (define-key org-mode-map (kbd "<visual-state> C-k") 'evil-goto-first-line)
    ;; (define-key org-mode-map (kbd "<visual-state> C-j") 'evil-goto-line)
    ;; (evil-global-set-key 'normal (kbd "SPC") 'photon/main)
    ;; (evil-global-set-key 'visual (kbd "SPC") 'photon/main)
    ;; (evil-global-set-key 'emacs (kbd "SPC") 'photon/main)
    ;; (evil-global-set-key 'motion (kbd "SPC") 'photon/main)
    ;; (evil-global-set-key 'operator (kbd "SPC") 'photon/main)
    (define-key transient-base-map (kbd "<escape>") 'transient-quit-all)

#+END_SRC

Define prefix keys
#+BEGIN_SRC emacs-lisp
;;  (which-key-add-key-based-replacements
;;    "SPC n" "Org Roam Commands"
;;    "SPC p" "LaTeX Preview Commands"
;;    "SPC v" "Transclusion Commands"
;;    )
#+END_SRC



