README.org
** Reset Garbage collection
#+BEGIN_SRC emacs-lisp
  (setq gc-cons-threshold (expt 2 23))
#+END_SRC
