init.el

(setq gc-cons-threshold (expt 2 23))
